sh version - view system image
sh flash - show system images.
delete flash ... - del file in flash memory
show ip route - 
debug

show running-config | include ip domain-name
  view configured domain name
sh run
sh start
  Show startup-config.
reload

sh run int f2/0

Router commands, global configuration mode
  IP address
    interface FastEthernet0/0
      Interface configuration mode
    ip address 192.168.0.1 .255.255.255.0
    no shutdown
      Interfaces are shutdown by default.
  Setup wizard
    Router> en
    Router# setup

no enable secret - remove password

Set a password for enable prompt
  enable password is a legacy command.
  enable secret is in encrypted form.
  Commands
		config t - enter configuration 
		enable password Flackbox1
		enable secret Flackbox2

router DNS commands
  to config router to resolve FQDNs itself

To make router as DNS client:
Often we only work with IP addresses
	ip domain-lookup
    enable DNS resolution on router for hostnam-to-IP address translation.
    when enabled, ping example.com.
    resolve example.com using DNS first, command second.
    error message if DNS resolution failed.
	ip name-server 172.23.4.1 (primary domain name)
    configure DNS server IP addresses
	ip domain-name flackboxA.lab (additional DNS suffix to search)
    configure the default domain name for the device.
    When ip domain-lookup enabled,
      it will append the default domain name to the hostname.
      ping router1 -> resolve router1.example.com
  copy running-config startup-config
    save the config to the router's startup config
  test with ping or nslookup followed by a hostname.

To make router as DNS server:
After the DNS client commands.
  ip dns server
    configure it as a DNS server
  ip host LinuxA 172.23.4.2
    address records to be resolved

show arp: view ARP cache
clear arp-cache: clear ARP cache

CDP Cisco Discovery Protocol
  To share info with other Cisco equipment.
  Map out how devices are connected.

Switch
  IP address
    Switch (config)# interface vlan 1
    Switch (config-if)# ip address 192.168.0.10 255.255.255.0
    Switch (config-if)# no shutdown
    Switch (config-if)# exit
    Switch (config)# ip default-gateway 192.168.0.1
  Hostname
    Switch (config)# hostname SW1
    SW1 (config)
  Description
    SW1 (config)# interface FastEthernet 0/1
    SW1 (config-if)# description Link to R1
  Interface speed and duplex
    SW1 (config)# interface FastEthernet 0/1
    SW1 (config-if)# duplex full
    SW1 (config-if)# speed 100
  Verification commands
    SW1# show running-config
      Show entire configuration.
      Spacebar for page down.
    SW1# show ip interface brief
    SW1# show run interface vlan 1
    SW1# show interface vlan 1
    SW1# sh int fast0/1
      Shows MAC and IP addresses, traffic statistic.
      Useful for troubleshooting int.
    SW1# show version
  CDP Cisco discovery Protocol
    Switch (config)# cdp run
    Switch (config)# no cdp run
    Switch (config-if)# no cdp enable
    Switch# show cdp
    Switch# show cdp neighbours
    Switch# show cdp neighbours detail

Factory Reset router/switch
  write erase
    In enable prompt, it erases the startup-config.
  Reload to boot up with blank config.
  Setup wizard will run.

The Config Register
  To change the way router boots.
  0x2102 - boot normally (default)
  0x2120 - boot into rommon
  0x2142 - ignore NVRAM contents (startup-config)
  Commands:
    show version | include Configuration register
    config-register 0x2142 or confreg (rommon prompt)
  Router enable password recovery procedure:
    Press Ctrl-Break break sequence at power on to break into rommon prompt.
    confreg 0x2142 
    reset
    Router bootup with no config.
    Press no to by pass setup wizard.
    Enter enable mode.
    Copy startup config to running config. (IMPORTANT)
    Enter a new enable secret in global config mode.
    config-register 0x2102 - boot normally
    copy run start - save config.

Backing up the System Image and Configuration
  Commands
    copy flash tftp
    copy running-config tftp
    copy startup-config usd

Backing up configuration in lab env
  Set up the starting configuration.
  Copy to Flash.
  Continue with any changes.
  write erase - to erase the startup-config.
  copy flash start
  reload

Upgrading IOS system image
  Select switch model.
  Get new IOS software images from Cisco website.
    https://software.cisco.com
  Copy to TFTP server.
  Download it to Flash from TFTP.
  Del the old system image or use boot system command.
    Commands
      config t
      boot system flash:...
      end
      copy run start
      reload
